**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [ ]:
import pandas as pd
import numpy as np

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'], 
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df= pd.DataFrame(data,index=labels)
df

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [ ]:
df.describe()

            age     visits
count  8.000000  10.000000
mean   4.437500   2.900000
std    2.007797   0.875595
min    1.500000   2.000000
25%    3.375000   2.000000
50%    4.000000   3.000000
75%    5.625000   3.750000
max    8.000000   4.000000

**3. Print the first 2 rows of the birds dataframe **

In [ ]:
df[:2]

    birds  age  visits priority
a  Cranes  3.5       2      yes
b  Cranes  4.0       4      yes

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [ ]:
print(list(df.columns))
print(df[['birds','age']])

['birds', 'age', 'visits', 'priority']
        birds  age
a      Cranes  3.5
b      Cranes  4.0
c     plovers  1.5
d  spoonbills  NaN
e  spoonbills  6.0
f      Cranes  3.0
g     plovers  5.5
h      Cranes  NaN
i  spoonbills  8.0
j  spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [ ]:
#!pip install pandasql

Requirement already satisfied: pandasql in /usr/local/lib/python3.6/dist-packages (0.7.3)
Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.6/dist-packages (from pandasql) (1.3.20)
Requirement already satisfied: numpy in /usr/local/lib/python3.6/dist-packages (from pandasql) (1.19.4)
Requirement already satisfied: pandas in /usr/local/lib/python3.6/dist-packages (from pandasql) (1.1.5)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.6/dist-packages (from pandas->pandasql) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.6/dist-packages (from pandas->pandasql) (2018.9)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2.7.3->pandas->pandasql) (1.15.0)

In [ ]:
ps.sqldf("select birds,age,visits from df")

        birds  age  visits
0      Cranes  3.5       2
1      Cranes  4.0       4
2     plovers  1.5       3
3  spoonbills  NaN       4
4  spoonbills  6.0       3
5      Cranes  3.0       4
6     plovers  5.5       2
7      Cranes  NaN       2
8  spoonbills  8.0       3
9  spoonbills  4.0       2

In [ ]:
new_df=ps.sqldf("select birds,age,visits from df")
new_df[:5]

        birds  age  visits
0      Cranes  3.5       2
1      Cranes  4.0       4
2     plovers  1.5       3
3  spoonbills  NaN       4
4  spoonbills  6.0       3

In [43]:
new_df.index.name='id'
new_df

         birds  age  visits
id
0       Cranes  3.5       2
1       Cranes  4.0       4
2      plovers  1.5       3
3   spoonbills  NaN       4
4   spoonbills  6.0       3
5       Cranes  3.0       4
6      plovers  5.5       2
7       Cranes  NaN       2
8   spoonbills  8.0       3
9   spoonbills  4.0       2

In [46]:
ps.sqldf("select birds,age,visits from new_df where id in(2,3,7)")

        birds  age  visits
0     plovers  1.5       3
1  spoonbills  NaN       4
2      Cranes  NaN       2

**6. select the rows where the number of visits is less than 4**

In [ ]:
ps.sqldf("select * from df where visits<4")

        birds  age  visits priority
0      Cranes  3.5       2      yes
1     plovers  1.5       3       no
2  spoonbills  6.0       3       no
3     plovers  5.5       2       no
4      Cranes  NaN       2      yes
5  spoonbills  8.0       3       no
6  spoonbills  4.0       2       no

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [ ]:
ps.sqldf("select birds,visits from df where age isnull")

        birds  visits
0  spoonbills       4
1      Cranes       2

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [ ]:
ps.sqldf("select * from df where birds == 'Cranes' and age <4")

    birds  age  visits priority
0  Cranes  3.5       2      yes
1  Cranes  3.0       4       no

**9. Select the rows the age is between 2 and 4(inclusive)**

In [ ]:
ps.sqldf("select *from df where age between 2 and 4 ")

        birds  age  visits priority
0      Cranes  3.5       2      yes
1      Cranes  4.0       4      yes
2      Cranes  3.0       4       no
3  spoonbills  4.0       2       no

**10. Find the total number of visits of the bird Cranes**

In [ ]:
ps.sqldf("select sum(visits) from df where birds == 'Cranes'")

   sum(visits)
0           12

**11. Calculate the mean age for each different birds in dataframe.**

In [ ]:
df.groupby("birds")['age'].mean()

birds
Cranes        3.5
plovers       3.5
spoonbills    6.0
Name: age, dtype: float64

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [ ]:
df.loc['k']=['Cranes',	2.5,3	,'no']
df

        birds  age  visits priority
a      Cranes  3.5       2        1
b      Cranes  4.0       4        1
c     plovers  1.5       3        0
d  spoonbills  NaN       4        1
e  spoonbills  6.0       3        0
f      Cranes  3.0       4        0
g     plovers  5.5       2        0
h      Cranes  NaN       2        1
i  spoonbills  8.0       3        0
j  spoonbills  4.0       2        0
k      Cranes  2.5       3       no

In [ ]:
df=df.drop('k')
df

        birds  age  visits priority
a      Cranes  3.5       2        1
b      Cranes  4.0       4        1
c     plovers  1.5       3        0
d  spoonbills  NaN       4        1
e  spoonbills  6.0       3        0
f      Cranes  3.0       4        0
g     plovers  5.5       2        0
h      Cranes  NaN       2        1
i  spoonbills  8.0       3        0
j  spoonbills  4.0       2        0

**13. Find the number of each type of birds in dataframe (Counts)**

In [ ]:
df['birds'].value_counts()

Cranes        4
spoonbills    4
plovers       2
Name: birds, dtype: int64

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [ ]:
df.sort_values(by=['age','visits'],ascending=[False,True])

        birds  age  visits priority
i  spoonbills  8.0       3       no
e  spoonbills  6.0       3       no
g     plovers  5.5       2       no
j  spoonbills  4.0       2       no
b      Cranes  4.0       4      yes
a      Cranes  3.5       2      yes
f      Cranes  3.0       4       no
c     plovers  1.5       3       no
h      Cranes  NaN       2      yes
d  spoonbills  NaN       4      yes

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [ ]:
df = df.replace(to_replace = ['yes','no'],value = ['1','0'])
df

        birds  age  visits priority
a      Cranes  3.5       2        1
b      Cranes  4.0       4        1
c     plovers  1.5       3        0
d  spoonbills  NaN       4        1
e  spoonbills  6.0       3        0
f      Cranes  3.0       4        0
g     plovers  5.5       2        0
h      Cranes  NaN       2        1
i  spoonbills  8.0       3        0
j  spoonbills  4.0       2        0

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [ ]:
df1 = df.replace(to_replace = ['Cranes'],value = ['trumpeters'])
df1

        birds  age  visits priority
a  trumpeters  3.5       2        1
b  trumpeters  4.0       4        1
c     plovers  1.5       3        0
d  spoonbills  NaN       4        1
e  spoonbills  6.0       3        0
f  trumpeters  3.0       4        0
g     plovers  5.5       2        0
h  trumpeters  NaN       2        1
i  spoonbills  8.0       3        0
j  spoonbills  4.0       2        0